# Python Libraries

Commonly used Python libraries:

* **Numpy (np)** a library for working with arrays of data

* **Pandas (pd)** provides high-performance, easy-to-use data structures and data analysis tools

* **Scipy** a library of techniques for numerical and scientific computing (only import specific functions)

* **Matplotlib.pyplot (plt)** plotting library for making graphs (only import the **pyplot** module)

* **Seaborn (sns)** a higher-level interface to Matplotlib that can be used to simplify many graphing tasks

* **Statsmodels.api (sm)** provides classes and functions for the estimation of many different statistical models

* **scikit-learn** a machine learning library with many of the same statistical techiques as Statsmodels (only import specific functions) 
  
  
NOTE: libraries can be imported in their entirety (with an alias) or just a portion of the library can be imported.  
* Importing a *library*: **import** numpy as np
* Importing a *module*: **import** matplotlib.pyplot as plt
* Importing a *function*: **from** numpy **import** arange

### Commonly used sample datasets

Seaborn sample datasets  
https://github.com/mwaskom/seaborn-data  
(used as a target for the seaborn.load_dataset function)

scikit-learn sample datasets (need to be conveted into datafames)  
https://scikit-learn.org/stable/datasets/index.html#toy-datasets  
(note: scikit-learn dataset objects have separate "data", "feature_names", and "target")

### Commonly used functions  

* **pd.read_csv** Pandas function to read *.csv files
* **df.describe()** produces descriptive stats on the numeric variables in a dataframe named "df"
* **df.head()** shows the top of the dataframe

The following code loads the Boston housing data from scikit-learn and creates a Pandas dataframe.

In [28]:
# Converting a scikit-learn sample dataset to a Pandas dataframe
# NOTE: scikit-learn sample datasets are a "bunch"
#    that includes "data", "feature_names", and "target"
import pandas as pd
from sklearn.datasets import load_boston
boston_data = load_boston()
#type(load_boston)   # type is: function
#type(boston_data)   # type is: sklearn.utils.Bunch
df_boston = pd.DataFrame(boston_data.data,columns=boston_data.feature_names)
df_boston['target'] = pd.Series(boston_data.target)  # appends a new column
df_boston.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,target
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [29]:
import pandas as pd
df1=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
#df1=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv')
#df1=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/mpg.csv')
df1.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [31]:
import seaborn
#df1 = seaborn.load_dataset("iris")
df1 = seaborn.load_dataset("titanic")
#df1 = seaborn.load_dataset("mpg")

# type(df1)
# df1.describe()
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [32]:
import seaborn
#df1 = seaborn.load_dataset("iris")
#df1 = seaborn.load_dataset("titanic")
df1 = seaborn.load_dataset("mpg")

# type(df1)
# df1.describe()
df1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [33]:
df1.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

NOTE: From this point forward, this notebook needs to be re-written

### Utilizing Library Functions

After importing a library, its functions can then be called from your code by prepending the library name to the function name.  For example, to use the '`dot`' function from the '`numpy`' library, you would enter '`numpy.dot`'.  To avoid repeatedly having to type the libary name in your scripts, it is conventional to define a two or three letter abbreviation for each library, e.g. '`numpy`' is usually abbreviated as '`np`'.  This allows us to use '`np.dot`' instead of '`numpy.dot`'.  Similarly, the Pandas library is typically abbreviated as '`pd`'.

The next cell shows how to call functions within an imported library:

In [ ]:
a = np.array([[1,2],[3,4]]) 
b = np.array([[11,12],[13,14]]) 

np.dot(a,b)

As you can see, we used the dot() function within the numpy library to calculate the dot product of two arrays, a and b.

# Data Management

Data management is a crucial component to statistical analysis and data science work.  The following code will show how to import data via the pandas library, view your data, and transform your data.

The main data structure that Pandas works with is called a **Data Frame**.  This is a two-dimensional table of data in which the rows typically represent cases (e.g. Cartwheel Contest Participants), and the columns represent variables.  Pandas also has a one-dimensional data structure called a **Series** that we will encounter when accesing a single column of a Data Frame.

Pandas has a variety of functions named '`read_xxx`' for reading data in different formats.  Right now we will focus on reading '`csv`' files, which stands for comma-separated values. However the other file formats include excel, json, and sql just to name a few.

There are many other options to '`read_csv`' that are very useful.  For example, you would use the option `sep='\t'` instead of the default `sep=','` if the fields of your data file are delimited by tabs instead of commas.  See [here](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html) for the full documentation for '`read_csv`'.

### Importing Data

In [ ]:
# Store the url string that hosts our .csv file
url = "Cartwheeldata.csv"

# Read the .csv file and store it as a pandas Data Frame
df = pd.read_csv(url)

# Output object type
type(df)

### Viewing Data

In [ ]:
# We can view our Data Frame by calling the head() function
df.head()

The head() function simply shows the first 5 rows of our Data Frame.  If we wanted to show the entire Data Frame we would simply write the following:

In [ ]:
# Output entire Data Frame
df

As you can see, we have a 2-Dimensional object where each row is an independent observation of our cartwheel data.

To gather more information regarding the data, we can view the column names and data types of each column with the following functions:

In [ ]:
df.columns

Lets say we would like to splice our data frame and select only specific portions of our data.  There are three different ways of doing so.

1. .loc()
2. .iloc()
3. .ix()

We will cover the .loc() and .iloc() splicing functions.

### .loc()
.loc() takes two single/list/range operator separated by ','. The first one indicates the row and the second one indicates columns.

In [ ]:
# Return all observations of CWDistance
df.loc[:,"CWDistance"]

In [ ]:
# Select all rows for multiple columns, ["CWDistance", "Height", "Wingspan"]
df.loc[:,["CWDistance", "Height", "Wingspan"]]

In [ ]:
# Select few rows for multiple columns, ["CWDistance", "Height", "Wingspan"]
df.loc[:9, ["CWDistance", "Height", "Wingspan"]]

In [ ]:
# Select range of rows for all columns
df.loc[10:15]

The .loc() function requires to arguments, the indices of the rows and the column names you wish to observe.

In the above case **:** specifies all rows, and our column is **CWDistance**. df.loc[**:**,**"CWDistance"**]

Now, let's say we only want to return the first 10 observations:

In [ ]:
df.loc[:9, "CWDistance"]

### .iloc()
.iloc() is integer based slicing, whereas .loc() used labels/column names. Here are some examples:

In [ ]:
df.iloc[:4]

In [ ]:
df.iloc[1:5, 2:4]

In [ ]:
df.iloc[1:5, ["Gender", "GenderGroup"]]

We can view the data types of our data frame columns with by calling .dtypes on our data frame:

In [ ]:
df.dtypes

The output indicates we have integers, floats, and objects with our Data Frame.

We may also want to observe the different unique values within a specific column, lets do this for Gender:

In [ ]:
# List unique values in the df['Gender'] column
df.Gender.unique()

In [ ]:
# Lets explore df["GenderGroup] as well
df.GenderGroup.unique()

It seems that these fields may serve the same purpose, which is to specify male vs. female. Lets check this quickly by observing only these two columns:

In [ ]:
# Use .loc() to specify a list of mulitple column names
df.loc[:,["Gender", "GenderGroup"]]

From eyeballing the output, it seems to check out.  We can streamline this by utilizing the groupby() and size() functions.

In [ ]:
df.groupby(['Gender','GenderGroup']).size()

This output indicates that we have two types of combinations. 

* Case 1: Gender = F & Gender Group = 1 
* Case 2: Gender = M & GenderGroup = 2.  

This validates our initial assumption that these two fields essentially portray the same information.